def song_length(x):
    """
    tuple(str) -> float

    Return float of second string
    >>> song_length(('jim', '3.14'))
    3.14
    """

    return float(x[1])

def title_length(x):
    """
    tuple(str) -> int

    Return length of first string
    >>> title_length(('jim', '3.14'))
    3
    """

    return len(x[0])

def last_word(x):
    """
    tuple(str) -> str

    Return last word of first string
    >>> last_word(('aa bb fff', '3.14'))
    'fff'
    """

    s = x[0]
    if s.count(' ') == 0:
        return s
    return s[s.rindex(' ') + 1:]

def sort_songs(song_titles, length_songs, key):
    """
    list(str), list(str), key -> list(tuple)

    Return sorted list of songs
    >>> sort_songs( ['Янанебібув', 'Той день', 'Мало мені', 'Сосни', 'Кавачай', 'Відпусти', 'Африка', 'Поясни', 'Фіалки', 'Коли тебе нема', 'Етюд'], ['3.19', '3.58', '5.06', '4.31', '4.39', '3.52', '4.24', '3.39', '3.43', '3.17', '2.21'], \
        song_length)
    [('Етюд', '2.21'), ('Коли тебе нема', '3.17'), ('Янанебібув', '3.19'), ('Поясни', '3.39'), ('Фіалки', '3.43'), ('Відпусти', '3.52'), ('Той день', '3.58'), ('Африка', '4.24'), ('Сосни', '4.31'), ('Кавачай', '4.39'), ('Мало мені', '5.06')]
    >>> sort_songs( ['Янанебібув', 'Той день', 'Мало мені', 'Сосни', 'Кавачай', 'Відпусти', 'Африка', 'Поясни', 'Фіалки', 'Коли тебе нема', 'Етюд'], ['3.19', '3.58', '5.06', '4.31', '4.39', '3.52', '4.24', '3.39', '3.43', '3.17', '2.21'], \
        title_length)
    [('Етюд', '2.21'), ('Сосни', '4.31'), ('Африка', '4.24'), ('Поясни', '3.39'), ('Фіалки', '3.43'), ('Кавачай', '4.39'), ('Той день', '3.58'), ('Відпусти', '3.52'), ('Мало мені', '5.06'), ('Янанебібув', '3.19'), ('Коли тебе нема', '3.17')]
    >>> sort_songs( ['Янанебібув', 'Той день', 'Мало мені', 'Сосни', 'Кавачай', 'Відпусти', 'Африка', 'Поясни', 'Фіалки', 'Коли тебе нема', 'Етюд'], ['3.19', '3.58', '5.06', '4.31', '4.39', '3.52', '4.24', '3.39', '3.43', '3.17', '2.21'], \
        last_word)
    [('Африка', '4.24'), ('Відпусти', '3.52'), ('Етюд', '2.21'), ('Кавачай', '4.39'), ('Поясни', '3.39'), ('Сосни', '4.31'), ('Фіалки', '3.43'), ('Янанебібув', '3.19'), ('Той день', '3.58'), ('Мало мені', '5.06'), ('Коли тебе нема', '3.17')]
    """

    if len(song_titles) != len(length_songs):
        return None
    songs = [(song_titles[i], length_songs[i]) for i in range(len(song_titles))]
    songs.sort(key=key)
    return songs


if __name__ == '__main__':
    import doctest
    print(doctest.testmod())
